In [11]:
import pandas as pd
data = pd.read_csv('titan.csv', index_col = 'PassengerId')
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

# Test 1

In [16]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

# Test 2

In [24]:
round(data['Survived'].value_counts(1)*100, 2)

0    61.62
1    38.38
Name: Survived, dtype: float64

# Test 3

In [78]:
round(data['Pclass'].value_counts(1)*100, 2)

3    55.11
1    24.24
2    20.65
Name: Pclass, dtype: float64

# Test 4

In [33]:
data['Age'].mean()

29.69911764705882

In [34]:
data['Age'].median()

28.0

# Test 5

In [42]:
data[['SibSp','Parch']].corr()

          SibSp     Parch
SibSp  1.000000  0.414838
Parch  0.414838  1.000000

# Test 6

In [91]:
data.loc[data['Sex'] == 'female']['Name'].str.split(',').str[1].value_counts()

 Miss. Mary                                          6
 Miss. Bertha                                        4
 Miss. Anna Sofia                                    3
 Miss. Anna                                          3
 Miss. Kate                                          2
 Miss. Hanora "Nora"                                 2
 Miss. Marija                                        2
 Miss. Alice                                         2
 Miss. Katherine "Katie"                             2
 Miss. Elizabeth                                     2
 Miss. Ellen "Nellie"                                2
 Miss. Marguerite Rut                                1
 Mrs. Samuel (Hannah Wizosky)                        1
 Miss. Hildur E                                      1
 Mrs. Sam (Leah Rosen)                               1
 Mrs. Emil (Tillie Mandelbaum)                       1
 Mrs. James Vivian (Lulu Thorne Christian)           1
 Miss. Anna Kristine                                 1
 Miss. Marie Grice                                   1
 Mrs. Frederick (Augusta Tyler)                      1
 Miss. Catherine Helen "Carrie"                      1
 Miss. Hilda Mary                                    1
 Mrs. Charles Melville (Clara Jennings Gregg)        1
 Miss. Katriina                                      1
 Mrs. Jean Baptiste (Rosalie Paula Govaert)          1
 Miss. Albina                                        1
 Mrs. Thomas Jr (Lily Alexenia Wilson)               1
 Miss. Sigrid Elisabeth                              1
 Mrs. Oscar W (Elisabeth Vilhelmina Berg)            1
 Miss. Saiide                                        1
                                                    ..
 Mrs. Edward Dale (Charlotte Lamson)                 1
 Mrs. Antoni (Selini Alexander)                      1
 Miss. Virginia Ethel                                1
 Mrs. Anders Johan (Alfrida Konstantia Brogren)      1
 Mrs. (Mary)                                         1
 Mrs. (Catherine David)                              1
 Miss. Mary Natalie                                  1
 Miss. Elizabeth Margaret                            1
 Mrs. Carl Oscar (Selma Augusta Emilia Johansson)    1
 Miss. Ida Sofia                                     1
 Miss. Katie                                         1
 Miss. Laina                                         1
 Miss. Ida                                           1
 Mrs. William (Margaret Norton)                      1
 Mrs. Thomas (Edith Wearne)                          1
 Miss. Helene Barbara                                1
 Miss. Augusta Charlotta                             1
 Mrs. Samuel (Jane Laver)                            1
 Mrs. Frederick Joel (Margaret Welles Barron)        1
 Miss. Velin                                         1
 Miss. Jamila                                        1
 Miss. Julie Rachel                                  1
 Miss. Hileni                                        1
 Miss. Elizabeth Mussey                              1
 Miss. Sara Rebecca                                  1
 Mrs. John (Catherine)                               1
 Miss. Margit Elizabeth                              1
 Mrs. Henry Sleeper (Myna Haxtun)                    1
 Miss. Agda Thorilda Viktoria                        1
 Miss. Delia                                         1
Name: Name, Length: 295, dtype: int64